//
//  main.c
//  带参数的宏定义
//
//  Created by xiaomage on 15/6/15.
//  Copyright (c) 2015年 xiaomage. All rights reserved.
//

#include <stdio.h>

int sum(int v1, int v2)
{
    return v1 + v2;
}

/*
 #define 代表要定义一个宏
 SUM 宏的名称
 (v1, v2) 参数, 注意点, 不需要写数据类型
 v1+v2 用于替换的内容
 
 宏定义并不会做任何运算, 无论是有参数还是没有参数都仅仅是在翻译成0和1之前做一个简单的"替换"
 
 带参数的宏定义注意点
 1.一般情况下建议写带参数的宏的时候, 给每个参数加上一个()
 2.一般情况下建议写带参数的宏的时候, 给结果也加上一个()
 */
#define SUM(v1, v2) v1+v2
// 要求定义一个带参数的宏, 用于计算两个变量的乘积
//#define CF(v1, v2) v1*v2
#define CF(v1, v2) (v1)*(v2)

// 要求定义一个带参数的宏, 用于计算某个数的平方

//#define PF(v1) (v1)*(v1)
#define PF(v1) ((v1)*(v1))

int main(int argc, const char * argv[]) {
    /*
    // 要求不适用函数, 实现计算两个变量的和
    int a = 10;
    int b = 15;
//    int res = sum(a, b);
    
//    SUM(a, b) v1 == a v2 == b
//    a+b
//    int res = a+b;
    int res = SUM(a, b);
      printf("res = %i\n", res);
     */
    
    
    /*
     什么时候用带参数的宏定义什么时候用函数
     如果函数内部的功能比较简单, 仅仅是做一些简单的运算那么可以使用宏定义, 使用宏定义效率更好, 运算速度更快
     如果函数内部的功能比较复杂, 不仅仅是一些简单的运算, 那么建议使用函数
     */
//    int res = CF(10, 10);
//    CF(5 + 5, 4 + 4)
//    5 + 5*4 + 4 == 29
    
//    CF(5 + 5,  4 + 4)
//    (5 + 5)*(4 + 4) == (10) * (8)
//    int res = CF(5 + 5, 4 + 4); // 10 * 8 = 80
    
    
//    int res = PF(4);
//    PF(2 + 2)
//    2 + 2*2 + 2
    
//    PF(2 + 2)
//    (2 + 2)*(2 + 2)
//    int res = PF(2 + 2);
    
//              16 / 16 * 16 == 1 * 16 == 16
//    PF(2 + 2) / PF(2 + 2) * PF(2 + 2)
//    (2 + 2)*(2 + 2) / (2 + 2)*(2 + 2) * (2 + 2)*(2 + 2)
//     4*4            /    4*4          *   4*4
//     16/4 == 4*4 == 16 * 4 = 64*4 == 256
    
    
    //         4 /     4     * 4  == 4
    //        PF(2) / PF(2) *  PF(2)
    //        (2)*(2) / (2)*(2) * (2)*(2)
    
    
//            PF(2) / PF(2) *  PF(2)
//       ((2)*(2))/((2)*(2)) * ((2)*(2))
//           4    /   4      *   4
//              1            * 4
    int res = PF(2) / PF(2) * PF(2);
    printf("res = %i\n", res);
    
    
    return 0;
}
