//
//  main.c
//  二维数组注意点
//
//  Created by xiaomage on 15/6/12.
//  Copyright (c) 2015年 xiaomage. All rights reserved.
//

#include <stdio.h>

int main(int argc, const char * argv[]) {
    // 1.二维数组的多种初始化方式
    // 1.定义的同时初始化
    int names[2][3] =
    {
        {'l', 'n', 'j'},
        {'x', 'm', 'g'}
    };
    // 2.先定义再初始化
    int names2[2][3];
    names2[0][0] = 'l';
    names2[0][1] = 'n';
    names2[0][2] = 'j';
    
    names2[1][0] = 'x';
    names2[1][1] = 'm';
    names2[1][2] = 'g';
    
    
    // 3.完全初始化
    int names3[2][3] =
    {
        {'l', 'n', 'j'},
        {'x', 'm', 'g'}
    };
    
    // 4.不完全初始化
    int names4[2][3] =
    {
        {'l', 'n'},
    };
    
    // 5.省略元素个数的两种写法
    // 明确的告诉二维数组, 我们有2个一维数组
    char names5[2][3] =
    {
        'l', 'n', 'j',
        'x', 'm', 'g'
    };
    char names15[2][3] =
    {
        'l', 'n', 'j',
        'x', 'm'
    };
    
    // 没有告诉二维数组我们有几个一维数组
    // 如果在"定义的同时"进行初始化, 那么一位数组的个数可以省略 \
    系统会自动根据每一个一维数组能够存放多少个元素, 自动根据初始化的值推断出二维数组中一共有多少个元素(多少个一维数组)
    char names6[][3] =
    {
        'l', 'n', 'j',
        'x', 'm', 'g',
        'n', 'b'
    };
    
    // 6.错误写法
    // 注意点: 每个一维数组的元素个数不能省略
    /*
    int names7[2][] =
    {
        {'l', 'n', 'j'},
        {'x', 'm', 'g'}
    };
     */
    /*
    // 搞不清楚应该分配多大的存储空间, 以及搞不清楚应该把哪些数据赋值给第一个数组, 以及哪些数据赋值给第二个数组
    int names7[2][] =
    {
        'l', 'n', 'j',
        'x', 'm', 'g'
    };
     */
    
    return 0;
}
